app/views/tournaments/_form.html.erb

  <% end %>
  <% players_array = Player.all.map { |player| [player.name] }%>
---
SELECT "players".* FROM "players"