app/views/tournaments/index.html.erb

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= tournament.venue %></td>
        <td><%= Player.find_by(id: tournament.winner).name %></td>