app/views/coaches/_form.html.erb

SELECT "players".* FROM "players"
---

<% players_array = Player.all.map { |player| [player.name] }%>