app/views/players/index.html.erb

        <td>Coach:
          <% if Coach.find_by(player_id: player.id) %>
            <%= Coach.find_by(player_id: player.id).name %>
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."player_id" = ? LIMIT ?  [["player_id", 4], ["LIMIT", 1]]

        <td>Matches:
          <% player.matches.each do |match| %>
---
SELECT "matches".* FROM "matches" INNER JOIN "games" ON "matches"."id" = "games"."match_id" WHERE "games"."player_id" = ?  [["player_id", 4]]

              ID: <%= match.id %>
              Tournament: <%= Tournament.find_by(id: match.tournament_id)["name"] %>
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]