app/views/matches/_form.html.erb

  </div>
  <% tournament_array = Tournament.all.map { |t| [t.name] }%>
---
SELECT "tournaments".* FROM "tournaments"


  <% players_array = Player.all.map { |player| [player.name] }%>
---
SELECT "players".* FROM "players"

      <div class="field">
        <%= form.select :firstPlayer, players_array %>
---
SELECT "players".* FROM "players"