app/views/matches/index.html.erb

SELECT "players".* FROM "players" INNER JOIN "games" ON "players"."id" = "games"."player_id" WHERE "games"."match_id" = ?  [["match_id", 1]]
---
        <td>Type: <%= match.matchtype %></td>
        <td>Players: [
          <% match.players.each do |player| %>
            <%= player.name %>,
          <% end %>
          ]