app/controllers/coaches_controller.rb

SELECT "coaches".* FROM "coaches"
---
  def index
    @coaches = Coach.all

SELECT  "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Roger Federer"], ["LIMIT", 1]]
INSERT INTO "coaches" ("name", "created_at", "updated_at", "age", "country", "player_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ivan Ljubičić"], ["created_at", "2020-04-26 23:27:22.514930"], ["updated_at", "2020-04-26 23:27:22.514930"], ["age", 44], ["country", "Micronesia"], ["player_id", 4]]
---
  def create
    coach_params[:player_id] = Player.find_by(name: coach_params[:player_id]).id
    @coach = Coach.new(coach_params)

    respond_to do |format|
      if @coach.save

SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_coach
      @coach = Coach.find(params[:id])