app/controllers/matches_controller.rb

    def set_match
      @match = Match.find(params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]