app/controllers/matches_controller.rb

  def index
    @matches = Match.all
---
SELECT "matches".* FROM "matches"

  def create
    mParams = params[:match]
    begin
      @tournament = Tournament.find_by(id: Integer(Tournament.find_by(name: mParams["tournament_id"]).id))
    rescue err
      return
    end

    @match = Match.new("matchtype": mParams[:matchtype])
    @match.tournament = @tournament

    respond_to do |format|
      if @match.save
        if mParams[:matchtype] == "Singles"
          @players = [
            Player.find_by(name: mParams[:firstPlayer]),
            Player.find_by(name: mParams[:secondPlayer])
          ]
        else
          @players = [
            Player.find_by(name: mParams[:firstPlayer]),
            Player.find_by(name: mParams[:secondPlayer]),
            Player.find_by(name: mParams[:thirdPlayer]),
            Player.find_by(name: mParams[:fourthPlayer])
          ]
        end

        @match.players << @players
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "matches" ("matchtype", "created_at", "updated_at", "tournament_id") VALUES (?, ?, ?, ?)  [["matchtype", "Singles"], ["created_at", "2020-04-26 21:56:55.266268"], ["updated_at", "2020-04-26 21:56:55.266268"], ["tournament_id", 1]]
SELECT  "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Roger Federer"], ["LIMIT", 1]]
INSERT INTO "matches" ("matchtype", "created_at", "updated_at", "tournament_id") VALUES (?, ?, ?, ?)  [["matchtype", "Doubles"], ["created_at", "2020-04-26 21:53:36.862323"], ["updated_at", "2020-04-26 21:53:36.862323"], ["tournament_id", 1]]

    def set_match
      @match = Match.find(params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]