app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT "players".* FROM "players"

  def destroy
    @player.destroy
---
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 3]]

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("name", "country", "ranking", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sinner, Jannik"], ["country", "Italy"], ["ranking", 19], ["created_at", "2020-04-26 23:28:32.783288"], ["updated_at", "2020-04-26 23:28:32.783288"]]

  def update
    respond_to do |format|
      if @player.update(player_params)
---
UPDATE "players" SET "country" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["country", "Switzerland!"], ["updated_at", "2020-04-24 21:00:19.964599"], ["id", 1]]

    def set_player
      @player = Player.find(params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]