app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    @tournaments = Tournament.all

SELECT  "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Wimbledon"], ["LIMIT", 1]]
INSERT INTO "tournaments" ("name", "venue", "winner", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Wimbledon"], ["venue", "?"], ["winner", 3], ["created_at", "2020-04-26 23:05:59.015781"], ["updated_at", "2020-04-26 23:05:59.015781"]]
---
  def create
    tParams = params[:tournament]
    @tournament = Tournament.new(name: tParams[:name], venue: tParams[:venue], winner: Player.find_by(name: tParams[:winner]).id)

    respond_to do |format|
      if @tournament.save

UPDATE "tournaments" SET "winner" = ?, "updated_at" = ? WHERE "tournaments"."id" = ?  [["winner", 0], ["updated_at", "2020-04-26 22:48:11.425009"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @tournament.update(tournament_params)

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_tournament
      @tournament = Tournament.find(params[:id])